Repository: desyatkoff/impressle
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: About Impressle
ru: О сайте Impressle

source: Here you can learn more about the Impressle website
ru: Здесь вы можете узнать больше про сайт Impressle

source: Unleash your creativity!
ru: Раскройте своё творчество!

source: Impressle is a unique social network where you have to draw by hand, not uploading image files. Follow your favorite artists, give likes to other users' pictures and make your own ones. It's fun, just try it!
ru: Impressle это уникальная социальная сеть где вы должны рисовать от руки, а не загрузать файлы картинок. Подписывайтесь на ваших любимых художников, ставьте лайки картинкам других пользователей и рисуйте свои. Это весело, просто попробуйте!

source: If you want to know how we collect, use, and protect your personal information, check the
ru: Если вы хотите знать как мы собираем, используем и защищаем вашу персональную информацию, проверьте

source: Privacy Policy
ru: Политика Конфиденциальности

source: Check the
ru: Проверьте

source: Frequently Asked Questions
ru: Часто Задаваемые Вопросы

source: for more details
ru: для подробностей

source: By the way, this is an open source project, you can check the source code on
ru: Кстати, это проект с открытым исходным кодом, вы можете посмотреть исходники на

source: this GitHub repository
ru: этом репозитории GitHub

source: You can become a contributor if you want :)
ru: Вы можете стать участником проекта если хотите :)

source: Admin Panel
ru: Админ панель

source: Inspect the database and ban inappropriate users/pictures/comments
ru: Просматривайте базу данных и баньте недопустимых пользователей/картинок/комментариев

source: Edit Data Panel
ru: Изменение данных

source: Table Name
ru: Название таблицы

source: Item UID
ru: UID

source: Column Name
ru: Название столбца

source: New Value
ru: Новое значение

source: Edit Value
ru: Изменить значение

source: Mark Data As "Deleted" Panel
ru: Помечение данных как "удалённые"

source: User UID
ru: UID пользователя

source: Picture UID
ru: UID картинки

source: Comment UID
ru: UID комментария

source: Mark As Deleted
ru: Пометить как удалённое

source: Delete Data From DB Panel
ru: Панель удаления данных из БД

source: Delete
ru: Удалить

source: Ban Panel
ru: Бан-панель

source: Ban
ru: Забанить

source: Database Panel
ru: База данных

source: You are Banned
ru: Вы забанены

source: Unfortunately, this account is banned! :(
ru: К сожалению, этот аккаунт забанен! :(

source: Uh oh...
ru: Ой-ой...

source: You can no longer log in to this account. Breaking the rules is bad, you know? It's allowed to create another account, and if you want to do this, you promise that you will not break the rules again
ru: Вы больше не можете войти в этот аккаунт. Нарушать правила плохо, вы понимаете? Разрешается создать ещё один аккаунт, но если вы хотите это сделать, обещайте что не нарушите правила снова

source: I will not break the rules next time
ru: Я не нарушу правила в следующий раз

source: Create New Account
ru: Создать новый аккаунт

source: Create Picture
ru: Создать картинку

source: Search
ru: Поиск

source: Recent Pictures
ru: Недавние картинки

source: Best Pictures
ru: Лучшие картинки

source: Popular Pictures
ru: Популярные картинки

source: Profile
ru: Профиль

source: Settings
ru: Настройки

source: You Liked
ru: Вы лайкнули

source: You Following
ru: Вы подписаны

source: Log In
ru: Войти

source: Sign Up
ru: Зарегистрироваться

source: About
ru: О сайте

source: FAQ
ru: ЧаВо

source: Log Out
ru: Выйти

source: Terms of Service
ru: Пользовательское Соглашение

source: Create a Picture
ru: Создать картинку

source: Let's draw your impressive picture!
ru: Давайте нарисуем вашу впечатляющую картинку!

source: Picture Title
ru: Название картинки

source: Picture Description
ru: Описание картинки

source: Brush Width
ru: Толщина кисти

source: Brush Color
ru: Цвет кисти

source: Publish
ru: Опубликовать

source: Reset Canvas
ru: Очистить

source: Author
ru: Автор

source: Commented on
ru: Прокомментировано

source: BANNED
ru: ЗАБАНЕН

source: Delete Comment
ru: Удалить комментарий

source: Ban Comment
ru: Забанить комментарий

source: ADMIN
ru: АДМИН

source: INACTIVE
ru: НЕАКТИВНЫЙ

source: follower(s)
ru: подписчика(ов)

source: Unfollow
ru: Отписаться

source: Follow
ru: Подписаться

source: Untitled
ru: Без названия

source: Published on
ru: Опубликовано

source: Description
ru: Описание

source: Delete Picture
ru: Удалить картинку

source: Ban Picture
ru: Забанить картинку

source: FAQ (Frequently Asked Questions)
ru: ЧаВо (Часто Задаваемые Вопросы)

source: If you have a question, you can find the answer here
ru: Если у вас есть вопрос, вы можете найти ответ здесь

source: 1. What is Impressle?
ru: 1. Что такое Impressle?

source: Impressle (impressle.fun) is a unique social network where you have to draw by hand, not uploading image files. Follow your favorite artists, give likes to other users' pictures and make your own ones!
ru: Impressle (impressle.fun) это уникальная социальная сеть где вы должны рисовать от руки, а не загрузать файлы картинок. Подписывайтесь на ваших любимых художников, ставьте лайки картинкам других пользователей и рисуйте свои!

source: 2. How to Become an Artist on Impressle?
ru: Как стать художником на Impressle?

source: Log in
ru: Войти

source: to your account, or
ru: в ваш аккаунт, или

source: sign up
ru: зарегистрируйтесь

source: if you do not have one
ru: если у вас его ещё нет

source: Go to
ru: Зайдите на

source: this page
ru: эту страницу

source: Draw something impressive
ru: Нарисуйте что-нибудь впечатляющее

source: Click "Publish" button
ru: Кликните кнопку "Опубликовать"

source: You are now officially a new artist!
ru: Теперь вы официально новый художник

source: 3. What is Karma?
ru: 3. Что такое карма?

source: Karma shows your reputation to others. Also, more karma -> higher rank. If your karma goes negative, you will be banned
ru: Карма показывает другим вашу репутацию. Также, больше кармы -> выше ранг. Если ваша карма станет отрицательной вы будете забанены

source: You get
ru: Вы получите

source: karma ...:
ru: кармы ...:

source: For publishing a picture
ru: За публикацию картинки

source: For every new follower
ru: За каждого нового подписчика

source: For every like on your picture
ru: За каждый лайк на вашей картинке

source: For every comment on your picture
ru: За каждый комментарий под вашей картинкой

source: For deleting a picture
ru: За удаление картинки

source: For every dislike on your picture
ru: За каждый дизлайк на вашей картинке

source: If your picture gets banned
ru: Если ваша картинка будет забанена

source: If your comment gets banned
ru: Если ваш комментарий будет забанен

source: 4. What is Rank?
ru: 4. Что такое ранг?

source: Rank shows your skills at drawing on Impressle
ru: Ранг показывает ваше умение рисовать в Impressle

source: Ranks list and how to get these ranks:
ru: Список рангов и как получить эти ранги:

source: Newbie
ru: Новичок

source: Given to all new users by default
ru: Даётся всем новым пользователям по умолчанию

source: Artist
ru: Художник

source: Given for getting at least 1 karma
ru: Даётся за получение хотя бы 1 кармы

source: Amateur
ru: Любитель

source: Given for getting 25 karma
ru: Даётся за получение 25 кармы

source: Cool
ru: Крутой

source: Given for getting 50 karma
ru: Даётся за получение 50 кармы

source: Skilled
ru: Опытный

source: Given for getting 100 karma
ru: Даётся за получение 100 кармы

source: Impressive
ru: Впечатляющий

source: Given for getting 1000 karma
ru: Даётся за получение 1000 кармы

source: Also, there are some secret ranks that aren't listed here...
ru: Также, здесь есть несколько секретных рангов которые здесь не указаны...

source: 5. Are There Any Limits On Posting Pictures?
ru: 5. Есть ли здесь какие-то ограничения на выкладывание картинок?

source: No! You can post as many pictures as you want without any limits, but if you will spam empty or strange pictures you will be banned
ru: Нет! Вы можете публиковать картинки сколько хотите без каких-либо лимитов, но если вы будете спамить пустыми или странными картинками вы будете забанены

source: 6. What is [ INACTIVE ] Tag?
ru: 6. Что означает [ НЕАКТИВНЫЙ ]?

source: Every user should do some activity on Impressle, otherwise the account may be deleted because of inactivity. If the account was inactive for last 30 days, it will be marked with [ INACTIVE ] tag and the account owner (user) will not be able to log in to their account
ru: Каждый пользователь должен хоть сколько-то активнячать на Impressle, в противном случае аккаунт может быть удалён за неактивность. Если аккаунт был неактивен на протяжении 30 дней, он будет помечен меткой [ НЕАКТИВНЫЙ ] и владелец аккаунта (пользователь) больше не сможет войти в его аккаунт

source: Just visit the website sometimes, it's not that hard. You don't have to post every day if you don't want to
ru: Просто посещайте этот сайт иногда, это не так уж и трудно. Хотя, вы не должны выкладывать картинки каждый день если не хотите конечно

source: Also, if you want to leave the Impressle community forever, you can delete your account (
ru: Также, если вы хотите покинуть сообщество Impressle навсегда, вы можете удалить свой аккаунт (

source: -> Delete Account) and it will be marked as inactive instantly so the other users could understand that this account is "dead"
ru: -> Удалить аккаунт) и он моментально будет помечен как неактивный, так что другие пользователи поймут что аккаунт является "мёртвым"

source: 7. What If My Account/Picture/Comment Gets Banned?
ru: 7. Что если мой аккаунт/картинка/комментарий будет забанен?

source: If your account gets banned, you will not be able to log in to your account anymore and other users will see [ BANNED ] tag in your profile
ru: Если ваш аккаунт будет забанен, вы больше не сможете войти в него и другие пользователи увидят значок [ ЗАБАНЕН ] в вашем профиле

source: If your picture gets banned, it will not be showed at the Feed page, but users still can view the picture in your profile
ru: Если ваша картинка будет забанена, она больше не будет показываться в ленте постов, но пользователи смогут видеть её в вашем профиле

source: If your comment gets banned, its text will be replaced with [ BANNED ]
ru: Если ваш комментарий будет забанен, его текст будет заменён на [ ЗАБАНЕН ]

source: Just don't be a bad guy and everything will be fine :)
ru: Просто не будьте плохим и всё будет отлично :)

source: 8. Can I Trust This Website?
ru: 8. Могу ли я доверять этому сайту?

source: Absolutely. Source code of Impressle is available on GitHub. You can check it on
ru: Абсолютно. Исходный код Impressle доступен на GitHub. Вы можете проверить его в

source: this repository
ru: этом репозитории

source: 9. I Didn't Find The Answer to My Question Here. Where to Ask?
ru: 9. Я не нашёл ответ на мой вопрос здесь. Где спросить?

source: If you have some questions, you can ask on official Impressle Telegram community group. Currently, there are available English and Russian channels and groups. All of them are listed
ru: Если у вас есть несколько вопросов, вы можете задать их в официальной группе Impressle в Telegram. На данный момент, доступны английский и русский каналы и группы. Все они перечислены

source: here
ru: здесь

source: Also, you can ask on GitHub
ru: Также, вы можете спросить на GitHub

source: Impressle repository
ru: Репозиторий Impressle

source: Feed
ru: Лента постов

source: Find the newest pictures
ru: Найдите новейшие картинки

source: Find the most liked pictures
ru: Найдите самые залайканные картинки

source: Find the most viewed pictures
ru: Найдите самые просматриваемые картинки

source: It seems that there are no any pictures... :(
ru: Кажется, здесь нет ни одной картинки... :(

source: Let's fix this, click
ru: Давайте исправим это, кликните

source: and Impressle will not be empty
ru: и Impressle не будет пустым

source: All your favorite users are listed right here
ru: Все ваши любимые пользователи перечислены прямо тут

source: This Account is Inactive
ru: Этот аккаунт неактивен

source: You can no longer log in to this account. Why did that happened? Actual reasons:
ru: Вы больше не можете войти в этот аккаунт. Почему это произошло? Актуальные причины:

source: You deactivated this account intentionally (Settings -> Delete Account)
ru: Вы деактивировали этот аккаунт намеренно (Настройки -> Удалить аккаунт)

source: Your account may be deactivated because of inactivity (if you didn't visit Impressle for the last 30 days)
ru: Ваш аккаунт может быть деактивирован из-за неактивности (если вы не заходили в Impressle за последние 30 дней)

source: Try
ru: Попробуйте

source: creating a new account
ru: создать новый аккаунт

source: if you want to use Impressle
ru: если хотите пользоваться Impressle

source: Welcome to Impressle
ru: Добро пожаловать на Impressle

source: Welcome to the
ru: Добро пожаловать на

source: On this website, you can...:
ru: На этом веб-сайте, вы можете...:

source: Draw funny pictures
ru: Рисовать забавные картинки

source: Like and comment others' pictures
ru: Лайкать и комментировать картинки других пользователей

source: Get the highest rank to become the best
ru: Получить высший ранг чтобы стать лучшим

source: Get karma to show others your reputation and drawing skills
ru: Получать карму чтобы показать остальным вашу репутацию и навыки рисования

source: Follow your favorite artists and get your own followers too
ru: Подписываться на ваших любимых художников и получать своих собственных подписчиков

source: Isn't it impressive?
ru: Разве это не впечатляет?

source: Create an account and start drawing your funny pictures on Impressle!
ru: Создайте аккаунт и начните рисовать ваши весёлые картинки на Impressle!

source: Ready to join the community? Click
ru: Готовы присоединиться к сообществу? Кликните

source: to create your own account. Let's start!
ru: чтобы создать ваш собственный аккаунт. Давайте начнём!

source: All the pictures you have liked
ru: Все картинки которые вам понравились

source: Welcome Back!
ru: С возвращением!

source: Here you can log in to your account
ru: Здесь вы можете войти в свой аккаунт

source: Username
ru: Имя пользователя

source: Password
ru: Пароль

source: New to Impressle?
ru: Новенький в Impressle?

source: Picture
ru: Картинка

source: Comment
ru: Комментарий

source: Send
ru: Отправить

source: Effective Date:
ru: Дата вступления в силу:

source: 1. Introduction
ru: 1. Введение

source: Welcome to impressle.fun ("we," "us," or "our"). This Privacy Policy explains how we collect, use, and protect your personal information when you use our website. By using our services, you agree to the practices described in this policy.
ru: Добро пожаловать на impressle.fun ("мы", "нас" или "наше"). Эта Политика Конфиденциальности объясняет как мы собираем, используем и защищаем вашу персональную информацию когда вы используете наш сайт. Используя наш сервис, вы соглашаетесь с указаниями, которые описаны в этой политике

source: 2. Information We Collect
ru: 2. Информация, которую мы собираем

source: We collect the following information:
ru: Мы собираем следующую информацию:

source: 2.1. Information You Provide
ru: 2.1. Информация которую вы предоставляете

source: Account Creation
ru: Создание аккаунтов

source: When you create an account, we collect your username and password.
ru: Когда вы создаёте аккаунт, мы собираем ваше имя пользователя и пароль.

source: User-Generated Content
ru: Пользовательский контент

source: Any content (text, images, etc.) you create, post, or publish on our website.
ru: Любой контент (текст, изображения и т.д.) который вы создаёте, выкладываете, публикуете на нашем веб-сайте.

source: 2.2. Automatically Collected Information
ru: 2.2. Автоматически собранная информация

source: Technical Data
ru: Технические данные

source: IP address, browser type, device information, and usage data (e.g., pages visited).
ru: IP адрес, тип браузера, информация об устройстве и данные об использовании (например, страницы которые вы посетили).

source: Cookies
ru: Куки

source: We use cookies to improve your experience (see Section 7 for details).
ru: Мы используем куки для улучшения вашего опыта (смотрите Раздел 7 для подробностей).

source: 3. How We Use Your Information
ru: 3. Как мы используем вашу информацию

source: We use your information to:
ru: Мы используем вашу информацию чтобы:

source: Provide and maintain our services.
ru: Предоставлять и поддерживать наш сервис.

source: Moderate user-generated content to ensure compliance with our
ru: Модерировать пользовательский контент для обеспечения соблюдения

source: Communicate with you (e.g., account updates or security alerts).
ru: Коммуницировать с вами (например, обновления аккаунта или оповещения о безопасности)

source: Analyze website performance and improve user experience.
ru: Анализировать производительность сайта и улучшать пользовательский опыт

source: 4. Sharing Your Information
ru: 4. Распространение вашей информации

source: We may share your information in the following cases:
ru: Мы можем поделиться вашей информацией в следующих случаях:

source: Public Content
ru: Публичный контент

source: Content you post is visible to all users.
ru: Контент который вы публикуете виден всем пользователям.

source: Legal Compliance
ru: Соблюдение законодательства

source: To comply with laws, regulations, or legal requests.
ru: Для соблюдения законов, правил или юридических запросов.

source: Service Providers
ru: Поставщики услуг

source: Third-party services may access data to help operate our website.
ru: Сторонние службы могут получать доступ к данным, чтобы помочь в работе нашего сайта.

source: We do not sell your personal information to third parties.
ru: Мы не продаём вашу личную информацию сторонним сервисам.

source: 5. Your Rights
ru: 5. Ваши права

source: You have the right to:
ru: Вы имеете право на:

source: Access, correct, or delete your account information.
ru: Доступ, корректировку или удаление вашей информации об аккаунте.

source: Delete user-generated content you have posted.
ru: Удалять пользовательский контент который вы опубликовали.

source: Withdraw consent for data processing (where applicable).
ru: Отзывать согласие на обработку данных (если применимо).

source: 6. Data Security
ru: 6. Безопасность данных

source: We implement security measures such as encryption and access controls to protect your data.
ru: Мы применяем такие меры безопасности, как шифрование и контроль доступа, чтобы защитить ваши данные.

source: 7. Cookies and Tracking
ru: 7. Куки и отслеживание

source: What We Use
ru: Что мы используем

source: Cookies for functionality (e.g., login sessions) and analytics (e.g., Google Analytics).
ru: Куки для функциональности (например, сеансы входа в систему) и аналитику (например, Google Analytics).

source: How to Manage
ru: Как управлять

source: Adjust your browser settings to block or delete cookies.
ru: Настройте ваш браузер для блокировки или удаления куки.

source: 8. Children's Privacy
ru: 8. Конфиденциальность детей

source: Our website is open to users aged 12 and older.
ru: Наш сайт доступен пользователям от 12 лет или старше.

source: If you are under 18, you confirm that a parent or guardian has consented to your use of our services.
ru: Если вам меньше 18, вы подтверждаете, что ваши родители или опекуны дали согласие на использование нашего сервиса.

source: Parents/guardians may contact us to review or delete their child's data.
ru: Родители/опекуны могут связаться с нами чтобы проверить или удалить данные их ребёнка.

source: 9. Changes to This Policy
ru: 9. Изменения условий

source: We may update this Privacy Policy. Continued use of the website after changes constitutes acceptance of the revised policy.
ru: Мы можем обновлять Политику Конфиденциальности. Продолжение использования нашего сайта после внесения изменений означает согласие с пересмотренными условиями

source: 10. Links to Other Policies
ru: 10. Ссылки на другие правила

source: Review our
ru: Посмотрите наше

source: for rules about using our website.
ru: для ознакомления с правилами использования нашего сайта.

source: Picture Search
ru: Поиск картинки

source: Find some pictures by your search query
ru: Найдите несколько картинок по вашему поисковому запросу

source: Could not find pictures for you... :(
ru: Не смогли подобрать картинки для вас... :(

source: Hello, New User!
ru: Привет, новый пользователь!

source: Let's create a new account
ru: Давайте создадим новый аккаунт

source: About Me
ru: Обо мне

source: I have read the
ru: Я прочитал

source: and
ru: и

source: Already have an account?
ru: Уже есть аккаунт?

source: Welcome to impressle.fun! By accessing or using our website, you agree to comply with and be bound by these Terms of Service ("Terms"). If you do not agree to these Terms, you may not use our services.
ru: Добро пожаловать на impressle.fun! Заходя на наш сайт или используя его, вы соглашаетесь соблюдать и быть связанными настоящими Условиями предоставления услуг ("Условия"). Если вы не согласны с этими Условиями, вы не можете пользоваться нашими услугами.

source: 2. Eligibility
ru: 2. Соответствие требованиям

source: Age Requirement
ru: Возрастное требование

source: You must be at least 12 years old to create an account or use our services.
ru: Вам должно быть как минимум 12 лет чтобы создать аккаунт или использовать наш сервис.

source: Parental Consent
ru: Согласие родителей

source: If you are under the age of 18, you confirm that you have obtained consent from a parent or legal guardian to use this website.
ru: Если вам меньше 18, вы подтверждаете, что ваши родители или опекуны дали согласие на использование нашего сервиса.

source: 3. User Accounts
ru: 3. Пользовательские аккаунты

source: Account Security
ru: Безопасность аккаунта

source: You are responsible for maintaining the confidentiality of your account credentials.
ru: Вы несёте ответственность за сохранение конфиденциальности своих личных данных.

source: 4. User-Generated Content
ru: 4. Пользовательский контент

source: Content Ownership
ru: Владение контентом

source: You retain ownership of any content you create, post, or upload to Impressle.
ru: Вы сохраняете право собственности на любой контент, который вы создаёте, размещаете или загружаете на Impressle.

source: License to Us
ru: Лицензия для нас

source: By posting content, you grant Impressle a non-exclusive, royalty-free, worldwide license to use, display, reproduce, and distribute your content in connection with our services.
ru: Размещая контент, вы предоставляете Impressle неисключительную, безвозмездную, всемирную лицензию на использование, отображение, воспроизведение и распространение вашего контента в связи с нашим сервисом.

source: Prohibited Content
ru: Запрещённый контент

source: You agree not to post content that:
ru: Вы соглашаетесь не размещать контент который:

source: Violates any law or infringes intellectual property rights.
ru: Нарушает какой-либо закон или ущемляет права интеллектуальной собственности.

source: Is abusive, harassing, discriminatory, or harmful.
ru: Является оскорбительным, преследующим, дискриминационным или вредным.

source: Contains viruses, malware, or spam.
ru: Содержит вирусы, вредоносные программы или спам.

source: Content Moderation
ru: Модерация контента

source: We reserve the right to remove or disable access to any content that violates these Terms.
ru: Мы оставляем за собой право удалять или закрывать доступ к любому контенту, нарушающему настоящие Условия.

source: 5. Your Responsibilities
ru: 5. Ваша ответственность

source: You agree to:
ru: Вы соглашаетесь:

source: Use the website lawfully and respectfully.
ru: Использовать сайт законно и уважительно.
