Repository: desyatkoff/impressle
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: Not impersonate others or engage in fraudulent activities.
ru: Не выдавать себя за других людей и не участвовать в мошеннических действиях.

source: Not interfere with the website's security or functionality.
ru: Не вмешиваться в безопасность или функциональность сайта.

source: 6. No Paid Services
ru: 6. Нет платных услуг

source: Impressle is free to use. We do not offer paid subscriptions, products, or services.
ru: Impressle бесплатен в использовании. Мы не предлагаем платных подписок, продуктов или услуг.

source: 7. Privacy
ru: 7. Конфиденциальность

source: Your use of our services is governed by our
ru: Использование вами наших услуг регулируется нашей

source: which explains how we collect, use, and protect your data.
ru: в которой объясняется, как мы собираем, используем и защищаем ваши данные.

source: 8. Limitation of Liability
ru: 8. Ограничение ответственности

source: Impressle is provided "as is". We are not liable for:
ru: Impressle предоставляется "как есть". Мы не несём ответственности за:

source: Any damages arising from your use of the website.
ru: Любой ущерб, возникший в результате использования вами веб-сайта.

source: The accuracy, quality, or legality of user-generated content.
ru: Точность, качество или законность пользовательского контента.

source: Unauthorized access to your account or data.
ru: Несанкционированный доступ к вашему аккаунту или данным.

source: 9. Termination
ru: 9. Расторжение договора

source: By You
ru: По вашей инициативе

source: You may delete your account at any time.
ru: Вы можете удалить ваш аккаунт в любое время.

source: By Us
ru: По нашей инициативе

source: We reserve the right to suspend or terminate your account if you violate these Terms.
ru: Мы оставляем за собой право приостановить или прекратить действие вашего аккаунта если вы нарушите настоящие Условия.

source: 10. Change to These Terms
ru: 10. Изменения условий

source: We may update these Terms at any time. Continued use of the website after changes constitutes acceptance of the revised Terms.
ru: Мы можем обновлять эти Условия. Продолжение использования нашего сайта после внесения изменений означает согласие с пересмотренной политикой

source: 11. Governing Law
ru: 11. Регулирующее законодательство

source: These Terms are governed by the laws of Russian Federation. Any disputes will be resolved in the courts of Russian Federation.
ru: Эти Условия регулируются законодательством Российской Федерации. Любые споры будут разрешаться в судах Российской Федерации.

source: 12. Final Agreement
ru: 12. Окончательное соглашение

source: These Terms constitute the entire agreement between you and Impressle.
ru: Эти Условия представляют собой полное соглашение между вами и Impressle.

source: ONLINE
ru: В СЕТИ

source: OFFLINE
ru: НЕ В СЕТИ

source: MODERATOR
ru: МОДЕРАТОР

source: Nothing yet...
ru: Пока что ничего...

source: Account Details
ru: Подробности об аккаунте

source: User ID
ru: ID пользователя

source: Account Created
ru: Аккаунт создан

source: Rank
ru: Ранг

source: Karma
ru: Карма

source: Edit Profile
ru: Настроить профиль

source: Delete User
ru: Удалить пользователя

source: Ban User
ru: Забанить пользователя

source: Set the preferences for your account
ru: Задать настройки для вашего аккаунта

source: Profile Settings
ru: Настройки профиля

source: Save
ru: Сохранить

source: Privacy Settings
ru: Настройки приватности

source: Show followers count in my profile
ru: Показывать количество подписчиков в моём профиле

source: Allow users to comment my pictures
ru: Разрешить пользователям комментировать мои картинки

source: Show "online" status in my profile
ru: Показывать статус "в сети" в моём профиле

source: Delete Account
ru: Удалить аккаунт

source: I am totally sure I want to delete this account
ru: Я точно уверен что я хочу удалить этот аккаунт

source: Admin
ru: Админ

source: Moderator
ru: Модератор
